{"scopus-eid": "2-s2.0-34548453938", "originalText": "serial JL 271743 291210 291728 291780 291840 31 Ecological Modelling ECOLOGICALMODELLING 2006-10-06 2006-10-06 2010-10-08T02:45:02 1-s2.0-S0304380006003449 S0304-3800(06)00344-9 S0304380006003449 10.1016/j.ecolmodel.2006.07.014 S300 S300.1 FULL-TEXT 1-s2.0-S0304380006X04295 2015-05-14T06:43:49.314216-04:00 0 0 20070110 2007 2006-10-06T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype subheadings volfirst volissue webpdf webpdfpagecount figure body affil articletitle auth authfirstini authfull authkeywords authlast primabst ref alllist content subj ssids 0304-3800 03043800 200 200 1 2 1 2 Volume 200, Issues 1–2 17 178 182 178 182 20070110 10 January 2007 2007-01-10 2007 Research papers article fla Copyright © 2006 Elsevier B.V. All rights reserved. ECOSYSTEMSAREPHYSICOCHEMICALBIOLOGICALENTITIES SCHIZAS D 1 Introduction 1.1 Reductionism versus holism 1.2 Overcoming reductionism 1.2.1 The ontological innovations 1.2.2 The methodological innovations 2 Possible future developments 3 Conclusions References BERGANDI 1995 145 180 D BERGANDI 2000 928 942 D EMMECKE 1997 83 119 C FATH 2004 341 343 B FATH 1998 127 143 B FATH 1999 167 179 B FATH 1999 193 205 B FATH 2001 493 506 B HOFMEYER 1997 933 936 J SEMIOTICSAROUNDWORLDPROCEEDINGSFIFTHCONGRESSINTERNATIONALASSOCIATIONFORSEMIOTICSTUDIESBERKLEY1994 GLOBALSEMIOSPERE HOFMEYER 1997 355 376 J JORGENSEN 2000 249 284 S JORGENSEN 2001 S FUNDAMENTALSECOLOGICALMODELLING KORFIATIS 1999 K NATUREINECOLOGY NATUREINLIGHTCONTEMPORARYTHEORETICALECOLOGY KRIVTSOV 2004 37 54 V KULL 1998 299 310 K MANSSON 1993 582 596 B NIELSEN 2000 23 31 S PATTEN 1978 206 222 B PATTEN 1982 79 219 B PATTEN 1990 2386 2393 B PATTEN 1993 597 602 B PATTEN 2001 423 443 B PATTEN 1997 221 284 B SHAROV 2001 211 228 A SHUGART 1998 H TERRESTRIALECOSYSTEMSINCHANGINGENVIRONMENTS SILBERSTEIN 2002 80 107 M PHILOSOPHYSCIENCE REDUCTIONEMERGENCEEXPLANATION STAMOU 1998 G ECOLOGYENVIRONMENTALSCIENCES MODERNSYNTHESISHYPOTHESISCOMPROMISES STRASKRABA 1999 3 39 M SCHIZASX2007X178 SCHIZASX2007X178X182 SCHIZASX2007X178XD SCHIZASX2007X178X182XD item S0304-3800(06)00344-9 S0304380006003449 1-s2.0-S0304380006003449 10.1016/j.ecolmodel.2006.07.014 271743 2010-11-08T17:29:59.237325-05:00 2007-01-10 1-s2.0-S0304380006003449-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0304380006003449/MAIN/application/pdf/89215bae0a63f93ce02751edb38e413c/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0304380006003449/MAIN/application/pdf/89215bae0a63f93ce02751edb38e413c/main.pdf main.pdf pdf true 241531 MAIN 5 1-s2.0-S0304380006003449-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0304380006003449/PREVIEW/image/png/c8435293e833afa2470601ace12e2082/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0304380006003449/PREVIEW/image/png/c8435293e833afa2470601ace12e2082/main_1.png main_1.png png 56260 849 656 IMAGE-WEB-PDF 1 1-s2.0-S0304380006003449-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0304380006003449/gr1/DOWNSAMPLED/image/jpeg/59c73a0bb80b25ba5a8a40d2b1d29a84/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0304380006003449/gr1/DOWNSAMPLED/image/jpeg/59c73a0bb80b25ba5a8a40d2b1d29a84/gr1.jpg gr1 gr1.jpg jpg 12213 219 284 IMAGE-DOWNSAMPLED 1-s2.0-S0304380006003449-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0304380006003449/gr1/THUMBNAIL/image/gif/ca06003b9facef7179c3868651131d1f/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0304380006003449/gr1/THUMBNAIL/image/gif/ca06003b9facef7179c3868651131d1f/gr1.sml gr1 gr1.sml sml 1330 93 121 IMAGE-THUMBNAIL 1-s2.0-S0304380006003449-gr2.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0304380006003449/gr2/DOWNSAMPLED/image/jpeg/16e59f906eb9000faa8f552769f9ff41/gr2.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0304380006003449/gr2/DOWNSAMPLED/image/jpeg/16e59f906eb9000faa8f552769f9ff41/gr2.jpg gr2 gr2.jpg jpg 9882 320 282 IMAGE-DOWNSAMPLED 1-s2.0-S0304380006003449-gr2.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0304380006003449/gr2/THUMBNAIL/image/gif/b9aa45efbe11fe676220353713df3e43/gr2.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0304380006003449/gr2/THUMBNAIL/image/gif/b9aa45efbe11fe676220353713df3e43/gr2.sml gr2 gr2.sml sml 727 93 82 IMAGE-THUMBNAIL ECOMOD 4468 S0304-3800(06)00344-9 10.1016/j.ecolmodel.2006.07.014 Elsevier B.V. Fig. 1 Pictorial representation of ‘environs’ conceived as an input-state-output object. Fig. 2 Graph of hypothetical substance flows from two prey, A and B, to predator C. No flow is involved in the competitive relation between A and B as in the two predator–prey interactions. What ecosystems really are—Physicochemical or biological entities? Dimitrios Schizas dimschizas@hotmail.com George Stamou ⁎ gpstamou@bio.auth.gr Department of Ecology, School of Biology, Aristotle University of Thessaloniki, 54124 Thessaloniki, Greece ⁎ Corresponding author. Tel.: +30 2310998354; fax: +30 2310998379. Abstract Classical systems ecology in the style of Howard Odum wasn’t genuinely holistic. Odum reduced ecological phenomena to storages, fluxes and transformations of energy and by doing so he undermined the autonomy of ecological science. To surmount this situation, Patten and coworkers offer an alternative framework, namely environ analysis. Resulting in novel ontological perspectives, environ analysis attempts to represent phenomena that are characteristically biological in nature, rather than purely physical or chemical. However, Patten and coworkers do not assign autonomy to ecosystem processes related to these phenomena and lead themselves to the “reductionist trap”. In an effort to escape this trap they throw off the traditional ecosystem models and proceed to methodological reforms. This way, they finally achieve to partly outmatch the reductionism associated traditionally with Systems Ecology, although the holding to a framework which overrates prediction probably jeopardizes the whole enterprise. Keywords Systems Ecology Environ analysis Network theory Holism Reductionism 1 Introduction It is generally accepted that traditional Systems Ecology did not respond successfully to the holistic request. For instance, despite passionate holistic declarations, Howard Odum, an originator of Systems Ecology, inclined to ‘hypereductionist’ approaches (Bergandi, 1995, 2000). This author produced the image of an ecosystem consisting of accumulated, released and interacting photons along with different forms of energy, finally transformed to heat (Mansson and McGlade, 1993). This way Odum discusses ecological phenomena exclusively in terms of thermodynamics. Accordingly, by subsuming analysis to physicochemical perspectives, Odum undermined the autonomy of Systems Ecology. Considering that reinforcement of holistic issues will result in reinforced autonomy of Systems Ecology, many ecologists attempted to modify the theoretical core of the old ecosystem paradigm. In this context different research programs focusing upon specific topics were independently initiated by scientists such as Levine, Ulanowicz, Herendeen, etc., For instance, employing optimization methods, Nielsen and Ulanowicz (2000) studied topics associated with thermodynamic efficiency. By contrast, Patten, Jorgensen and Straškraba in a series of papers published during 1992–2000 in ‘Ecological Modelling’, under the generic title ‘Ecosystems Emerging’ undertook the difficult task to reform the entire theoretical core of Systems Ecology. These authors confined their efforts exclusively within the theoretical core, ignoring the fact that different elements of the scientific edifice such as models, vocabularies, experimental designs, techniques for analysis of the empirical data, etc., have coevolved to work in concert with the theoretical perspectives. Meanwhile, however, Patten, in cooperation with his co-workers J. Finn, M. Higashi, T. Burns, S. Whipple, B. Fath and others, showed enhanced concern for methothological issues such as network analysis. Network analysis is a general methodological framework allowing for the study of entities as parts of a connected system. It entails tools such as graphs and matrix algebra and aims at identifying all those organizational patterns that underlie system behavior (Patten, 1978, 1982, 1990; Fath and Patten, 1998, 1999a,b; Fath et al., 2001; Fath, 2004). Specifically, Patten and co-workers deployed their own research program drawing upon General Systems Theory. Discussion of aspects relating to this endeavor is the object of this paper. In particular, we intend to discuss how these authors attempted to integrate environmental issues into ecological modelling in an aim to achieve their principal goals i.e. to overcome ecological reductionism seeking for interpretations exclusively at the physicochemical level (Fath and Patten, 1999a,b). We will show that in this regard they initiated a new theoretical approach termed ‘environ’ analysis to denote the analysis of the entire system of interrelations associated with each natural entity (Patten, 1978, 1982). More precisely, we will show that these theoretical innovations resulted (a) in novel ontological perspectives and (b) in methodological reforms. 1.1 Reductionism versus holism The objective of this paper concerns the reductionism versus holism issue. This issue often slips into obscurity and thereby a short clarification of some key terms may be proved useful. Ontological reductionism maintains that the most fundamental physical level, whatever that turns out to be, is ultimately the real “ontology” of the world. Accordingly, anything else that is to keep the status of real must somehow be able to be ‘mapped onto’ or ‘built out of’ those elements of the fundamental ontology (Silberstein, 2002). In this context ecosystem is conceived as nothing more than a physical structure consisted of aggregates of physical particles (physical component parts) and matter–energy interchanges (physical relations). Apparently, this reductionist version of ecosystem takes no notice of the property of life and therefore disregards issues concerning the emergence of the biological level out of the physical one. As a counterpart, ontological holism (or emergentism) rejects the idea that there is any fundamental level of ontology. Instead, it holds that there is a pluralistic ontology further specified to emergent (the biological arising from the physical, the psychical from the biological and the social from the psychical; Emmecke et al., 1997) and by some means independent domains. Analogous remarks could be made for epistemological and methodological reductionism and holism provided that we focus on epistemological (epistemology refers to our theories or descriptions) and methodological issues. We will not further elaborate these topics. The only thing we would like to emphasize is that holists are also called autonomists because they defend biology's autonomy with respect to physics and chemistry. More specifically they claim that it is impossible to reduce scientific elements (elements that form a coevolved unity such as concepts, theoretical schemata, theories, etc.) about biological wholes (about phenomena qualitatively distinct from the physical ones) to analogous elements about their physico-chemical parts (Looijen, 1998). The holistic request, for example, presupposes that the formulation of physical causal relations or mechanisms is not sufficient to predict or explain the behavior of organisms. In the case of ecosystem ecology, it also presupposes that organisms’ behavior is one way or another influenced by the function of the ecosystem (this latter considered as a whole appearing emergent properties) but this aspect of autonomy although important will not be thoroughly scrutinized in this article. Despite the attention we will pay on organizational aspects of the ecosystem, our primary concern is to show that if ecosystem ecology is going to take its place in the interior of science as an autonomous biological discipline, it should foremost avoid disconnecting ecology from biology. 1.2 Overcoming reductionism 1.2.1 The ontological innovations Patten predicates that irrespective of Odum's beliefs, organizational rather than energy issues were of primary importance in his scientific edifice. In contrast, he considers energetics as a secondary element of the ‘Odumian’ construct (Patten, 1993: 598). He states, literally, that the energy metaphor of Odum is part of his scientific edifice only for two extraneous reasons. Firstly, because “… he sought to anchor his theory in what he saw as basic reductionistic science …” and secondly, because “… he had to have something concrete to measure since he is an empirical ecologist …”. Consequently, in an attempt to defend the holistic declarations of Odum, Patten put particular emphasis on organizational aspects. However, within the Network Ecological Theory framework, holistic issues are differently treated. Firstly, Patten conceived ‘environ’ as an input-state-output object (Fig. 1 ; Patten, 1978, 1982). Secondly, he argues that apart from simple matter–energy exchanges (transactions), relations have also a significant organizational role (Patten et al., 1997). Thereupon, Patten et al. (1997: 248) mention that although relations stem from conservative transactions, they, nevertheless, can also serve as causes. Moreover, the authors stress the seminal possibilities of relational couplings. According to Krivtsov (2004), mentioning relations the adherents of the Network Ecological Theory mean predation, mutualism, competition, commensalism and the like. This way, they attempt to describe the within ecosystem interactions qualitatively. It is worth pointing out that for Patten the significance of relations relates to communicative processes such as information exchanges and semiotic phenomena. These latter are supposed to emphasise semantic aspects of information such as the transmission and interpretation of signals (Patten et al., 1997: 248). The above singular definition of relations results from an innovative definition of life. According to Patten et al. (1997: 232–233), the emergent property of life associates with a cognitive-like or anthropomorphic feature, namely, the model-making capacity. In particular, living entities make models of reality, meaning that they first interpret environmental signals and then respond to these interpretations. Within such a subjective perspective, biota goes well beyond simple irritability and stimulus-response dynamics in exhibiting a capacity to be proactive. Thus, contrary to non-living entities (objects), which are just passive responders to physical and chemical signals, “[l]iving things … act as agencies, with self-interest the basis for their environmental relations” (Patten et al., 1997: 233). It is noticeable that the discrimination between non-living and living entities is also formally expressed (Patten, 1982; Patten et al., 1997). Indeed, within the state-space theory, non-living objects are represented with a couple of functions: (a) the state transition function and (b) the response function. For living entities, however, a third function ‘μ’, termed the modeling function, is added. This latter acquires the form of a transition function and stands for the conversion of physical to phenomenal inputs (Patten et al., 1997). The conclusion from the above discussion is that considering biological entities as free agents with cognitive-like capacities the authors upgrade the organizational role of relations. Thus, Patten and co-workers, take a distance from the ‘Odumian’ hypereductionist viewpoint. Apparently, they attempt to consider issues concerning the emergence of the biological level from the physical one and supply ecosystem studies with ecological realism, which was lacking in Odum's work. 1.2.2 The methodological innovations Although upgrading their role, the authors do not assign autonomy to relations. The starting point of the analysis is matter–energy exchanges between ecosystem compartments. This way, relations are derived from transactions. Thereupon, Patten (1990: 2388, 2389) insists that in ‘environ’ analysis relations (non-flow effects) are derived from substance flows and also that “… environ theory is even beginning to convert flows to relations …”. The above situation is exemplified in Fig. 2 by depicting the trophic interaction between the predator C and two competing prey A and B. Although both aspects, transactions and relations, are taken into account, the analysis gives priority to the former. When referring to trophic relations shown in Fig. 2, Patten states that the two prey compete to escape predation through mechanisms that “… are implicit in the flow quantities and interconnective topology of the system …” (Patten, 1990: 2390). The fact that relations could be derived from transactions implies that the consideration of relational ecological phenomena may lead to the reductionist trap. In fact, subordination of relations to transactions and then quantification of the latter within a physicochemical context means Network Analysis trapped within reductionist ideas. Yet, to escape the trap, Patten and co-workers throw off the traditional ecosystem models. Actually, the usual method for ecosystem studies involves the collection of data for the entire system and the pictorial representation of system dynamics using flow diagrams (Taylor, 1988). Then, differential equations standing for changing state variables are formulated (Shugart, 1998) so that flow diagrams are transformed into mechanistic simulation models. These latter are used for understanding, for prediction of systems behavior or exploration of alternative scenarios, e.g., how the system will respond to perturbations, etc. Nevertheless, the above approach is often criticized for arbitrary assumptions such as the aggregation of species into trophic compartments, questionable techniques for data collection and analysis, as well as for parameter estimation, etc. (e.g. Taylor, 1988). Instead of mechanistic traditional models Patten and co-workers prefer phenomenological models. Phenomenological models do not describe flows dynamics and according to Patten (1990: 2387) are used for “… ex post facto analysis …”. Furthermore, he points out that environ analysis “… does not attempt to depict the mechanisms of causal or material flux; it only recognizes that such flux has occurred (input environs) or will occur (output environs), and proceeds from there to develop network-oriented implications …”. Apparently, for Patten the scientific effort is completed with the description of a system structure. No equations regarding the system dynamics are formulated and ecosystem models offer simple snapshots of the ecosystem at a particular time (Jørgensen and Bendoricchio, 2001). The conclusion is that the authors are aware of limitations resulting from the asymmetry of the dynamical models accounting only for transactions. For instance, Patten (2001: 425) considers ‘environs’ limited structures because they only analyze transactions. Accounting for transactive causality and encompassing relational causality – this latter is not specified (Patten, 2001: 435) – the static analysis proposed by the authors responds to the holistic request because it allows for the breakthrough of the above asymmetry and thereby ‘environ’ analysis may avoid the pitfall of reductionism. However, the authors do not appear completely satisfied by this solution. In fact, the advocates of Network Ecological Theory argue that prediction is of primary importance for ecology (Straškraba et al., 1999). Thus, Patten facing relevant objections, considers static models transient in the history of ‘environ’ analysis and looks to future dynamical models allowing for prediction (Patten, 1990). Yet, in a later paper (Fath and Patten, 1999a: 176), Patten appears more optimistic, stating that matrices of static models may capture the underlying principles that also apply in dynamic cases. 2 Possible future developments In the previous paragraphs, we concluded that the authors consider ‘environ’ analysis as incompletely developed because modeling, at the present time, disregards issues concerning dynamic system behavior and scientific prediction. In the next paragraphs, we will discuss two possible issues relating to further developments of ‘environ’ analysis. The first perspective is associated with alternative approaches concerning the optimization of ecosystem functions. Patten and his co-workers are already involved in relevant discussions and have made an effort to codify and unify different optimization criteria towards a network analysis perspective (Jørgensen et al., 2000; Fath et al., 2001). In this regard, the authors will probably encounter questions relating to reductionism. In fact, within this framework, hypotheses concerning ecosystem development are dedicated to systems phenomenology, that is, to description of processes, while they ignore underlying mechanisms. However, to construct dynamical predictive models relevant approaches employ tools and terminology from thermodynamics, which relate to mechanisms. Then, given the asymmetry associated with dynamical modeling, at the present time, it is not clear how these efforts could escape the aforementioned hypereductionist trap. Nevertheless, we would consider another possibility regarding dynamic modeling, that is to explore how relations as well as semiotic phenomena influence ecosystem dynamics. Within the ‘environ’ analysis framework, however, this perspective would probably be faced with the unsolvable problem of treating relations taking into consideration both qualitative and quantitative aspects. Actually, the risk is related to reified structures, that is to arbitrary quantification of qualitative processes (Stamou, 1998). This problem results from inability to quantify the supposed capacity of biota to transform physical inputs into phenomenological signals and then to include produced estimates into the study of ecosystem energetics. In that case, hypotheses relating to the theory's coherence (e.g., those associated with proactivity and creativity) should be confirmed. Otherwise the relative autonomy of the biological sphere will be unsettled. 3 Conclusions Several ecologists such as Patten, Jørgensen, Straškraba and Fath, among others, undertake the difficult task to substantiate holistic aspects of a Network Ecological Theory. We consider these efforts a reaction to the dominance of superreductionist ‘Odumian’ ideas that undermined the autonomy of Systems Ecology. Actually, ‘Odumian’ ecology is very often reproached for missing biological perspectives. The objections refer to neglecting organisms’ life histories and subordination of biological species to physicochemical laws and principles so that the autonomy of ecology is finally jeopardised (Korfiatis, 1999). In this paper, we conclude that in an attempt to ‘ecologize’ the old ecosystem paradigm the adherents of Network Ecological Theory propose a holistic approach. In this regard, apart from matter–energy exchanges (transactions), they also pinpoint the importance of qualitative and indirect material processes, namely relations. They hope that by identifying conceptual relationships between transactions and relations, they will be able to describe the organization of the entire system (Fath and Patten, 1998). Their efforts are concentrated mainly on theoretical and modeling issues. Presumably, the authors conclude that either (a) the other elements of the scientific practice (e.g., vocabulary, experimental designs, methods for data gathering and analysis, etc.) contribute to an adequate extent to the autonomy of the field or (b) they are of negligible importance. Within this context the authors propose a novel definition of life. Specifically, they assign the status of living only to entities which are able to elaborate models of reality. This way, relations are linked to communicative processes (e.g., information exchanges) and semiotic phenomena (e.g., transmission and interpretation of signals). Attributing to ecosystems semiotic perspectives (Patten et al., 1997), Patten and his co-workers assign to biological agents active roles in the unfolding of ecosystem processes. This means that organisms are considered neither simple energy transformers nor mere links in energy chains. Actually, the authors make an implicit distinction between interpretations elaborated at the biological level from those evolving at the physicochemical level and it undoubtedly reinforces the autonomy of the field. However, impacted by empiricist ideas, the authors are primarily concerned with transactions and Patten (2001) states literally that, based on matter–energy flows, material and physical processes have priority over communication and ‘semiosis’ (Patten, 2001). In practice, they deduce relations from transactions and describe qualitative ecological phenomena employing a physicochemical rather than a biological terminology. For example, studying competition, the authors ignore the terminology pertaining to population ecology and use, instead, terms derived from ecosystem energetics. Herein, the criticism refers to the fact that novel theoretical definitions are not accompanied by methodological novelties pertaining to biosemiotics. Relevant criticisms ask for methodologies that take into account the subjective nature of biological entities and argue for research objectives referring to the investigation of ecosystems behavior through a thorough understanding of semiotic relations and ethology (Hofmeyer, 1997a,b; Kull, 1998; Sharov, 2001). However, although their methodological practice casts a shadow on the question of “what ecosystems really are?”, ‘environ’ analysis achieves finally to partly outmatch the reductionism associated traditionally with Systems Ecology. However, the holding to a framework colored by empiricist ideals, which overrates prediction, probably jeopardizes the whole enterprise. References Bergandi, 1995 D. Bergandi ‘Reductionist holism’: an oxymoron or a philosophical chimera of E.P. Odum's Systems Ecology? Ludus Vitalis 3 1995 145 180 Bergandi, 2000 D. Bergandi Eco-cybernetics: the ecology and cybernetics of missing emergences Kybernetes 29 2000 928 942 Emmecke et al., 1997 C. Emmecke S. Køppe F. Stjernfelt Explaining emergence: towards an ontology of levels J. Gen. Philos. Sci. 28 1997 83 119 Fath, 2004 B. Fath Network analysis in perspective: comments on ‘WAND: an ecological network analysis user-friendly tool Environ. Modell. Software 19 2004 341 343 Fath and Patten, 1998 B. Fath B. Patten Network synergism: emergence of positive relations in ecological systems Ecol. Modell. 107 1998 127 143 Fath and Patten, 1999a B. Fath B. Patten Review of the foundations of network environ analysis Ecosystems 2 1999 167 179 Fath and Patten, 1999b B. Fath B. Patten Quantifying resource homogenization using network flow analysis Ecol. Modell. 123 1999 193 205 Fath et al., 2001 B. Fath B. Patten J. Choi Complementarity of ecological goal functions J. Theor. Biol. 208 2001 493 506 Hofmeyer, 1997a J. Hofmeyer The global semiospere I. Rauch G. Carr Semiotics Around the World. Proceedings of the Fifth Congress of The International Association for Semiotic Studies. Berkley 1994 1997 Mouton de Gruyter Berlin/New York 933 936 Hofmeyer, 1997b J. Hofmeyer Biosemiotics: towards a new synthesis in biology Eur. J. Semiotic Stud. 9 1997 355 376 Jørgensen et al., 2000 S.E. Jørgensen B.C. Patten M. Straškraba Ecosystems emerging: 4. Growth Ecol. Modell. 126 2000 249 284 Jørgensen and Bendoricchio, 2001 S. Jørgensen G. Bendoricchio Fundamentals of Ecological Modelling Third ed. 2001 Elsevier Science Ltd. Oxford Korfiatis, 1999 K. Korfiatis Nature in the light of the contemporary theoretical ecology M. Modinos H. Efthimiopoulos Nature in Ecology 1999 Stohastis Publications Athens (in Greek) Krivtsov, 2004 V. Krivtsov Investigations of indirect relationships in ecology and environmental sciences: a review and the implication for comparative theoretical ecosystem analysis Ecol. Modell. 174 2004 37 54 Kull, 1998 K. Kull On semiosis, Umvelt, and semiosphere Semiotica 120 1998 299 310 Looijen, 1998 Looijen, R., 1998. Holism and reductionism in biology and ecology. The mutual dependence of higher and lower level research programmes. Doctoral dissertation, Rijksuniversiteit Groningen. Mansson and McGlade, 1993 B.A. Mansson J.M. McGlade Ecology, thermodynamics and H.T. Odum's conjectures Oecologia 93 1993 582 596 Nielsen and Ulanowicz, 2000 S. Nielsen R. Ulanowicz On the consistency between thermodynamical and network approaches to ecosystems Ecol. Modell. 132 2000 23 31 Patten, 1978 B. Patten Systems approach to the concept of environment Ohio J. Sci. 78 1978 206 222 Patten, 1982 B. Patten Environs: relativistic elementary particles for ecology Am. Nat. 119 1982 79 219 Patten, 1990 B. Patten Environ theory and indirect effects a reply to Loehle Ecology 71 1990 2386 2393 Patten, 1993 B. Patten Toward a more holistic ecology and science: the contribution of H.T. Odum Oecologia 93 1993 597 602 Patten, 2001 B.C. Patten Jacob von Uexkull and the theory of environs Semiotica 134 2001 423 443 Patten et al., 1997 B.C. Patten M. Straškraba S.E. Jørgensen Ecosystems emerging: 1. Conservation Ecol. Modell. 96 1997 221 284 Sharov, 2001 A. Sharov Umvelt-theory and pragmatism Semiotica 134 2001 211 228 Shugart, 1998 H. Shugart Terrestrial Ecosystems in Changing Environments 1998 Cambridge University Press London Silberstein, 2002 M. Silberstein Reduction, emergence and explanation P. Machamer M. Silberstein Philosophy of Science 2002 Blackwell Publishers Ltd. Oxford 80 107 Stamou, 1998 G. Stamou The modern synthesis: an hypothesis of compromises M. Modinos H. Efthimiopoulos Ecology and Environmental Sciences 1998 Stohastis Publications Athens (in Greek) Straškraba et al., 1999 M. Straškraba S.E. Jorgensen B.C. Patten Ecosystems emerging: 2. Dissipation Ecol. Modell. 117 1999 3 39 Taylor, 1988 Taylor, P., 1988. Technocratic optimism, in: Odum, H.T. (Ed.), and the partial transformation of ecological metaphor after World War II. J. Hist. Biol. 21, 213–244.", "scopus-id": "34548453938", "coredata": {"eid": "1-s2.0-S0304380006003449", "dc:description": "Abstract Classical systems ecology in the style of Howard Odum wasn’t genuinely holistic. Odum reduced ecological phenomena to storages, fluxes and transformations of energy and by doing so he undermined the autonomy of ecological science. To surmount this situation, Patten and coworkers offer an alternative framework, namely environ analysis. Resulting in novel ontological perspectives, environ analysis attempts to represent phenomena that are characteristically biological in nature, rather than purely physical or chemical. However, Patten and coworkers do not assign autonomy to ecosystem processes related to these phenomena and lead themselves to the “reductionist trap”. In an effort to escape this trap they throw off the traditional ecosystem models and proceed to methodological reforms. This way, they finally achieve to partly outmatch the reductionism associated traditionally with Systems Ecology, although the holding to a framework which overrates prediction probably jeopardizes the whole enterprise.", "openArchiveArticle": "false", "prism:coverDate": "2007-01-10", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0304380006003449", "dc:creator": [{"@_fa": "true", "$": "Schizas, Dimitrios"}, {"@_fa": "true", "$": "Stamou, George"}], "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0304380006003449"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0304380006003449"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0304-3800(06)00344-9", "prism:volume": "200", "prism:publisher": "Elsevier B.V.", "dc:title": "What ecosystems really are—Physicochemical or biological entities?", "prism:copyright": "Copyright © 2006 Elsevier B.V. All rights reserved.", "openaccess": "0", "prism:issn": "03043800", "prism:issueIdentifier": "1-2", "dcterms:subject": [{"@_fa": "true", "$": "Systems Ecology"}, {"@_fa": "true", "$": "Environ analysis"}, {"@_fa": "true", "$": "Network theory"}, {"@_fa": "true", "$": "Holism"}, {"@_fa": "true", "$": "Reductionism"}], "openaccessArticle": "false", "prism:publicationName": "Ecological Modelling", "prism:number": "1-2", "openaccessSponsorType": null, "prism:pageRange": "178-182", "prism:endingPage": "182", "prism:coverDisplayDate": "10 January 2007", "prism:doi": "10.1016/j.ecolmodel.2006.07.014", "prism:startingPage": "178", "dc:identifier": "doi:10.1016/j.ecolmodel.2006.07.014", "openaccessSponsorName": null}, "objects": {"object": [{"@category": "standard", "@height": "219", "@width": "284", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0304380006003449-gr1.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "12213", "@ref": "gr1", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "93", "@width": "121", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0304380006003449-gr1.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "1330", "@ref": "gr1", "@mimetype": "image/gif"}, {"@category": "standard", "@height": "320", "@width": "282", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0304380006003449-gr2.jpg?httpAccept=%2A%2F%2A", "@multimediatype": "JPEG image file", "@type": "IMAGE-DOWNSAMPLED", "@size": "9882", "@ref": "gr2", "@mimetype": "image/jpeg"}, {"@category": "thumbnail", "@height": "93", "@width": "82", "@_fa": "true", "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S0304380006003449-gr2.sml?httpAccept=%2A%2F%2A", "@multimediatype": "GIF image file", "@type": "IMAGE-THUMBNAIL", "@size": "727", "@ref": "gr2", "@mimetype": "image/gif"}]}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/34548453938"}}