{"coredata": {"prism:url": "https://api.elsevier.com/content/article/pii/S0304380019302285", "dc:identifier": "doi:10.1016/j.ecolmodel.2019.108728", "eid": "1-s2.0-S0304380019302285", "prism:doi": "10.1016/j.ecolmodel.2019.108728", "pii": "S0304-3800(19)30228-5", "dc:title": "Modeling the frugivory of a plant with inconstant productivity and solid interaction with relictual vertebrate biota ", "prism:publicationName": "Ecological Modelling", "prism:aggregationType": "Journal", "prism:issn": "03043800", "prism:volume": "408", "prism:startingPage": "108728", "prism:pageRange": "108728", "articleNumber": "108728", "dc:format": "application/json", "prism:coverDate": "2019-09-15", "prism:coverDisplayDate": "15 September 2019", "prism:copyright": "© 2019 Elsevier B.V. All rights reserved.", "prism:publisher": "Elsevier B.V.", "dc:creator": [{"@_fa": "true", "$": "Bogoni, Juliano André"}, {"@_fa": "true", "$": "Navarro, Ana Beatriz"}, {"@_fa": "true", "$": "Graipel, Maurício Eduardo"}, {"@_fa": "true", "$": "Peroni, Nivaldo"}], "dc:description": "\n               Abstract\n               \n                  Universal features of ecological processes have mathematical properties that are naturally nonlinear and intricate, hitherto oftentimes approximated only by mathematical equations. We aimed to evaluate via mathematical modeling different scenarios of productivity and frugivory of Acca sellowiana (Feijoa) by vertebrates in the highlands of the subtropical Atlantic Forest. In doing so, based on an empirical baseline of mutualistic interactions, we simulated defaunation, species reintroduction and variations in resource production to understand the spatiotemporal dynamics of interactions within the network. We utilized empirical data of interactions obtained via camera traps from 2015 to 2016. We performed frugivory simulations based on the use of predator-prey models with the addition of exponential, logistical and structured growth. We evaluated 13 deterministic and stochastic models of frugivory and numerically compared the fruits removal rates among the models and empirical data. We conducted a weighted network formality analysis evaluating the general topology of networks, and a niche overlaps analysis of each scenario, to understand the variation in resource-sharing dynamics. Our results showed that vertebrates underexploited the potential of Feijoa as a subjacent resource, showing that the available fruits exceed the demand of local biota. The network robustness can be significantly changed by species loss or by rewilding. However, in all scenarios, resource-sharing is less than expected. The hypothetical removal by frugivores promote non-random negative effects in the potential seed dispersal process, whereas the increase of frugivores that may improve the reproductive success of Feijoa. Our insights allowed us to evaluate the magnitude of different scenarios of frugivory and to provide contributions to increase understanding of the relationship between fruit-eating and fleshy-fruited plants. Our results can be used as a proxy for conservation and management plans to predict ecological dynamics applying a species interaction perspective. Moreover, can be used to resources and landscapes management, especially in a region under an overwhelming contemporary defaunation process.\n               \n            ", "openaccess": "0", "openaccessArticle": false, "openaccessType": null, "openArchiveArticle": false, "openaccessSponsorName": null, "openaccessSponsorType": null, "openaccessUserLicense": null, "dcterms:subject": [{"@_fa": "true", "$": "Interactions"}, {"@_fa": "true", "$": "Vertebrate"}, {"@_fa": "true", "$": "Atlantic forest"}, {"@_fa": "true", "$": "Mathematical models"}, {"@_fa": "true", "$": "Defaunation"}, {"@_fa": "true", "$": "Ecological networks"}], "link": [{"@href": "https://api.elsevier.com/content/article/pii/S0304380019302285", "@rel": "self", "@_fa": "true"}, {"@href": "https://www.sciencedirect.com/science/article/pii/S0304380019302285", "@rel": "scidir", "@_fa": "true"}]}, "originalText": {"xocs:doc": {"xocs:meta": {"xocs:open-access": {"xocs:oa-article-status": {"@is-open-access": "0", "@is-open-archive": "0"}}, "xocs:available-online-date": {"@yyyymmdd": "20190713", "$": "2019-07-13"}}}}}