{"originalText": "serial JL 271728 291210 291772 291817 31 Transportation Research Part B: Methodological TRANSPORTATIONRESEARCHPARTBMETHODOLOGICAL 2003-03-24 2003-03-24 2010-03-26T22:18:01 1-s2.0-S019126159690017X S0191-2615(96)90017-X S019126159690017X 10.1016/S0191-2615(96)90017-X S350 S350.1 CONTENTS-ENTRY-ONLY 1-s2.0-S0191261500X00021 2015-05-14T05:39:52.915433-04:00 0 0 19960601 19960630 1996 2003-03-24T00:00:00Z rawtext articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate issuelist volumelist yearnav articletitlenorm cid cids contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issfirst issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype volfirst volissue webpdf webpdfpagecount articletitle alllist content subj ssids 0191-2615 01912615 30 30 3 3 Volume 30, Issue 3 5 I IV I IV 199606 June 1996 1996-06-01 1996-06-30 1996 converted-article mis Copyright © 1996 Published by Elsevier Ltd. All rights reserved. FORTHCOMINGPAPERS item S0191-2615(96)90017-X S019126159690017X 1-s2.0-S019126159690017X 10.1016/S0191-2615(96)90017-X 271728 2010-09-19T16:17:45.753762-04:00 1996-06-01 1996-06-30 1-s2.0-S019126159690017X-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S019126159690017X/MAIN/application/pdf/344157d869f5ccf4cd9e4f09f1bd92af/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S019126159690017X/MAIN/application/pdf/344157d869f5ccf4cd9e4f09f1bd92af/main.pdf main.pdf pdf true 292576 MAIN 4 1-s2.0-S019126159690017X-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S019126159690017X/PREVIEW/image/png/a138166cbccfb18294063dd075e14365/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S019126159690017X/PREVIEW/image/png/a138166cbccfb18294063dd075e14365/main_1.png main_1.png png 43806 849 656 IMAGE-WEB-PDF 1 Transpn. Res.-B. Vol. 30, No. 3, pp. I-IV, 1996 Published by Eisevier Science Ltd. Printed in Great Britain Pergamon 0191-2615/96 $15.00+0.00 FORTHCOMING PAPERS Transportation Research Part A Asya Pazy, Ilan Salomon and Tovi Pintzov. The impacts of women's career on their commuting behavior: a case study of Israeli computer professionals. Gang-Len Chang, Meenakshy Vasudevan and Chih-Chiang Su. Modelling and evaluation of adaptive bus-preemption control with and without AVL systems. Theodore C. Botimer. Efficiency considerations in airline pricing and yield management. Shangyao Yan and Hwei-Fwa Young. A decision support framework for multi-fleet routing and multi-stop flight scheduling. Shihsien Liu and Jon D. Pricker. Estimation of a trip table and the theta parameter in a stochastic network. Robert Cervero. Mixed land uses and commuting: evidence from the American Housing Survey. Yasser Hassan, Said M. Easa and A. 0. Abd El Halim. Passing sight distance on two-lane highways: review and revision. Alvaro Costa. The organisation of urban public transport systems in Western European metro- politan areas. Hai Yang and William H. K. Lam. Optimal road tolls under conditions ofqueueing and congestion. Chiu Liu, Robert Herman and Denos C. Gazis. A review of the yellow interval dilemma. Lars Moselhom, Jeff Silva and Timothy Larson. Forecasting carbon monoxide concentrations near a sheltered intersection using video traffic surveillance and neural networks. Richard J. Beckman, Keith A. Baggerly and Michael D. McKay. Creating synthetic baseline populations. Timothy Larson, Lars Moseholm, David Slater and Cyra Cain. Local background levels of carbon monoxide in an urban area. Kristiaan Kerstens. Technical efficiency measurement and explanation of French urban transit companies. J. P. Silcock. Designing signal-controlled junctions for group-based operation. Wei-Hua Lin and Carlos F. Daganzo. A simple detection scheme for delay-inducing freeway incidents. Patricia L. Mokhtarian and Ilan Salomon. Modeling the desire to telecommute: the importance of attitudinal factors in behavioral models. Martin Frost, Brian Linneker and Nigel Spence. The energy consumption implications of changing work travel. Anthony Chin and Peter Smith. Automobile ownership and government policy: the economics of Singapore's vehicle quota system. Daniel P. Sullivan and Rod J. Troutbeck. An exponential relationship for the proportion of free vehicles on arterial roads. I II Forthcoming Papers Linda K. Nozick and Edward K. Morlok. A model for medium-term operations planning in intermodal rail-truck service. Transportation Research Part B Gerard de Jong. A disaggregate model system of vehicle holding duration, type choice and use. Junn-Yuan Teng and Gwo-Hsiung Tzeng. A multiobjective programming approach for selecting non-independent transportation investment alternatives. Jifeng Wu and Gang-Len Chang. Estimation of time-varying origin/destination distributions with dynamic screenline flows. Ding Zhang and Anna Nagurney. On the local and global stability of a travel route choice adjustment process. H. P. Lo, W. H. K. Lam and N. Zhang. Estimation of an origin-destination matrix with random link choice proportions: a statistical approach. Athanasios K. Ziliaskopoulos and Hani S. Mahmassani.. A note on least time path computation considerating delays and prohibitions for intersection movements. Michiel A. Odijk. A constraint generation algorithm for the construction of railway timetables. David Watling. Asymmetric problems and stochastic process models of traffic assignment. Chandra R. Bhat. A generalized multiple durations proportional hazard model with an application to activity behavior during the evening work-to-home commute. Randolph W. Hall. On the integration of production and distribution: economic order and production quantity implications. Richard Tay, Patrick S. McCarthy and Jerald J. Fletcher. A portfolio choice model of the demand for recreational trips. Takashi Akamatsu. Cyclic flows, Markov process and stochastic traffic assignment. S. C. Wong. On the reserve capacities of priority junctions and roundabouts. Gregory K. S. Mung, Antonio C. K. Poon and William H. K. Lam. Distributions of queue lengths at fixed time traffic signals. Jovan Popovic and Dusan Teodorovic. An adaptive method for generating demand inputs to airline seat inventory control models. Marja-Liisa Siikonen. Customer service in an elevator system during up-peak. Hanif D. Sherali, Namita Arora and Antoine G. Hobeika. Parameter optimization methods for estimating dynamic origin-destination trip-tables. Shangyao Yan and Dah-Hwei Yang. A decision support framework for handling schedule perturbation. Joyce Dargay and Dermot Gately. The demand for transportation fuels: imperfect price reversibility. Chandra R. Bhat. Work travel mode choice and number of non-work commute stops. Hai Yang. Sensitivity analysis for the network equilibrium problem with elastic demand. Philip A. Viton. Technical efficiency in multi-mode bus transit: a DEA production frontier analysis. Carlos F. Daganzo. A continuum theory of traffic dynamics for freeways with special lanes. Chandra Bhat. Covariance heterogeneity in nested logit models: econometric structure and application to intercity travel. Forthcoming Papers III Masao Kuwahara. Decomposition of the reactive dynamic assignments with queues for a many-to- many origin-destination pattern. Accident Analysis and Prevention Michael J. Mer and lan Summersgill. A comprehensive methodology for the fitting of predictive accident models. Harmeet Sjren, Anders Eriksson and Mats Ostrom. Role of disease in traumatic deaths of motor vehicle drivers. Nils Petter Gregersen, Berndt Brehmer and Bertil Moren. Road safety improvement in large companies: an experimental comparison of different measures. Leonard Evans and Peter H. Gerrish. Antilock brakes and risk of front and rear impact in two- vehicle crashes. David W. Eby, Fredrick M. Streff and Carl Christoff. A comparison of two direct-observation methods for measuring daytime safety belt use. Rune Elvik. Does knowledge of safety effect help to predict how effective a measure will be? E. Petridou, A Polychronopoulou, E. Dounis, P. Tsampira, K. Revinthi and D. Tricholoulos. Risk factors for injuries among the elderly in Greece. Radin Umar R. S., Murray Mackay and Brian L. Hills. Modeling of conspicuity-related motor- cycle accidents in Seremban and Shah Alam Malaysia. David Grossman, Beth A. Mueller, Tricia Kenaston, Philip Salzberg, William Cooper and Gregory J. Jurkovich. The validity of police assessment of driver intoxication in motor vehicle crashes. W. Andrew Harrell. The effects of shopping cart design and prior behavioral history on children's standing in cart seats. Leonard Evans. Safety-belt effectiveness: the influence of crash severity and selective recruitment. Lucie Laflamme, Ewa Menckel and Lotta Lundholm. The age-related risk of occupational accidents: the case of Swedish iron-ore miners. Errol R. Hoffmann and Rudolf G. Mortimer. Scaling of relative velocity between vehicles. David C. Viano and Martin F. Gargan. Headrest position during normal driving: implications to neck injury risks in rear crashes. Petter Wulff. The safest way to travel - a matter of perspective. Gunilla Bring, Ulf Bjornstig and Goran Westman. Gender patterns in minor head and neck injuries: an analysis of casualty register data. Venkataraman Shankar, Fred Mannering and Woodrow Barfield. Statistical analysis of accident severity on rural freeways. Juha Luoma, Josef Schumann and Eric C. Truabe. Effects of retroreflector positioning on night- time recognition of pedestrians. Craig Zwerling, Nancy L. Sprince, Robert B. Wallace, Charles S. Davis, Paul S. Whitten and Steven G. Heeringa. Drinking, alcoholism and occupational injuries among older workers. Roderick J. McClure and Robert M. Douglas. The public health impact of minor injury. William Pickett, Robert J. Brison, Nelen Niezgoda and Mary L. Chipman. Nonfatal farm injuries in Ontario: A population-based survey. Robert A. Hagge and Patricia A. Romanowicz. Evaluation of California's commercial drivers license program. IV Forthcoming Papers D.L. Robinson. Head injuries and bicycle helmet laws. Guohua Li and Susan P. Baker. Exploring the male-female discrepancy in death rates from bicycling injury. Claude Dussault. Proposal: Behavioural feedback to risk variation ensues from unsatisfied appetency. Koshiro Ono and Munekazu Kanno. Influences of the physical parameters on risk to neck injuries in low impact speed rear-end collisions. Anne T. McCartt, Stephen A. Ribner, Allan I. Pack and Mark C. Hammer. The scope and nature of the drowsy driving problem in New York State. Steven M. Rock. Impact of the Illinois child passenger protection act: a retrospective look. Louis A. Le Blanc and Conway T. Rucks. A multiple discriminant analysis of vessel accidents. Corinne Peek-Asa and Jess F. Kraus. Injuries sustained by motorcycle riders in the approaching turn crash configuration. Denise Svendsgaard Williamson, Shrikant I. Bangdiwala, Stephen W. Marshall and Anna E. Waller. Repeated measures analysis of binary outcomes: applications to injury research. A. Gilchrist and N. J. Mills. Protection of the side of the head. Allan F. Williams and Charles M. Farmer. Comment on Theeuwes and Riemersma's revisit of daytime running lights. Peter M. Layde, Dean T. Stueland and David L. Nordstrom. Representativeness of trauma center registries for farm injury surveillance. Gwendolyn Haile Cattledge. Fatal occupational falls in the U. S. construction industry, 1980 to 1989. Gwendolyn Haile Cattledge, Aaron Schneiderman, Ronald Stanevich, Scott Hendricks and Judith Greenwood. Nonfatal occupational fall injuries in the West Virginia construction industry. Victor Siskind. Does license disqualification reduce reoffence rates? Carol A. Holland and Mark T. Conner. Exceeding the speed limit: an evaluation of the effectiveness of a police intervention. Mark R. Stevenson. The validity of children's self-reported exposure to traffic. Chantal S. Parenteau, David C. Viano, Per Lovsund and Claes Tingvall. Foot-ankle injuries: influence of crash location, seating position and age. Vera L. G. Blank, Lucie Laflamme and Finn Diderichsen. The impact of major transformations of a production process on age-related accident risks: a study of an iron-ore mine. Jau-Yih Tsauo, Wen-Chung Lee and Jung-Der Wang. Age-Period-Cohort analysis of motor vehicle mortality in Taiwan 1974-1992. Evelyn Vingilis, Edward Larkin, Gina Stoduto, Adele Parkinson-Heyes and Barry McLellan. Psychosocial sequelae of motor vehicle collisions: a follow-up study. John S. Sampalis, Hala Tamim, Andrs Nikolis, AndrLavoie and J. I. Williams. Predictive validity and internal consistency of the pre-hospital index measured on-site by physicians. Shoshana Weiss. What do Israeli Jewish and Arab adolescents know about drinking and driving? Jan Theeuwes and Johan Riemersma. Comment on Williams and Farmer's evaluation of daytime running lights. Rhonda M. Williams-Avery and David P. MacKinnon. Injuries and use of protective equipment among college in-line skaters. TRB 9690017X S0191-2615(96)90017-X 10.1016/S0191-2615(96)90017-X Forthcoming papers", "coredata": {"eid": "1-s2.0-S019126159690017X", "dc:description": null, "openArchiveArticle": "false", "prism:coverDate": "1996-06-30", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S019126159690017X", "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S019126159690017X"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S019126159690017X"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0191-2615(96)90017-X", "prism:volume": "30", "prism:publisher": "Published by Elsevier Ltd.", "dc:title": "Forthcoming papers", "prism:copyright": "Copyright © 1996 Published by Elsevier Ltd. All rights reserved.", "openaccess": "0", "prism:issn": "01912615", "prism:issueIdentifier": "3", "openaccessArticle": "false", "prism:publicationName": "Transportation Research Part B: Methodological", "prism:number": "3", "openaccessSponsorType": null, "prism:pageRange": "I-IV", "prism:endingPage": "IV", "prism:coverDisplayDate": "June 1996", "prism:doi": "10.1016/S0191-2615(96)90017-X", "prism:startingPage": "I", "dc:identifier": "doi:10.1016/S0191-2615(96)90017-X", "openaccessSponsorName": null}}