{"coredata": {"prism:url": "https://api.elsevier.com/content/article/pii/S0304380006003917", "dc:identifier": "doi:10.1016/j.ecolmodel.2006.08.013", "eid": "1-s2.0-S0304380006003917", "prism:doi": "10.1016/j.ecolmodel.2006.08.013", "pii": "S0304-3800(06)00391-7", "dc:title": "Plant acclimation to elevated CO2—From simple regularities to biogeographic chaos ", "prism:publicationName": "Ecological Modelling", "prism:aggregationType": "Journal", "prism:issn": "03043800", "prism:volume": "200", "prism:issueIdentifier": "3-4", "prism:startingPage": "433", "prism:endingPage": "451", "prism:pageRange": "433-451", "prism:number": "3-4", "dc:format": "application/json", "prism:coverDate": "2007-01-24", "prism:coverDisplayDate": "24 January 2007", "prism:copyright": "Copyright © 2006 Elsevier B.V. All rights reserved.", "prism:publisher": "Elsevier B.V.", "dc:creator": [{"@_fa": "true", "$": "Gutschick, Vincent P."}], "dc:description": "\n               Abstract\n               \n                  Upon exposure to altered levels of CO2, plants express a variety of acclimations to CO2 directly, over and above acclimations to indirect changes in temperature and water regimes. These acclimations commonly include increased photosynthetic CO2 assimilation and increased water-use efficiency with reduced N content and reduced stomatal conductance. The robust generic acclimations are explicable by combining simple models of carboxylation, stomatal control, energy balance, and functional balance. Species- or genotype-specific acclimations are overlaid on these generic acclimations. Several such specific acclimations that are often seen are readily incorporated in an extended model. These specific acclimations generate a great spread of values in key performance measures of photosynthesis, water- and N-use efficiencies, and rates of water and N use, even among C3 species that are the focus of this work. These performance measures contribute strongly to relative fitness and thus to evolving biogeographic distributions. The spread in fitness values is so large as to impend “chaotic” shifts in biogeography (and, ultimately, evolution) that are not understandable with models specific to species or functional groups; rather, a systematic study of key physiological and developmental parameters is merited. Also merited is a coherent extension of the model used here, or similar models, to include other phenomena, including mycorrhizal associations, transience in resource availability, etc. The composition of useful approximate fitness functions from physiological and allocational responses is a major challenge, with some leads originating from the model. In the search to extract patterns of responses, arguments based on the responses being close to optimal or adaptive will be misleading, in view of the absence of selection pressure to perform adaptively at high CO2 for over 20 million years. I offer suggestions for more useful research designs.\n               \n            ", "openaccess": "0", "openaccessArticle": false, "openaccessType": null, "openArchiveArticle": false, "openaccessSponsorName": null, "openaccessSponsorType": null, "openaccessUserLicense": null, "dcterms:subject": [{"@_fa": "true", "$": "CO2\n                  "}, {"@_fa": "true", "$": "Acclimation"}, {"@_fa": "true", "$": "Models"}, {"@_fa": "true", "$": "Biogeography"}], "link": [{"@href": "https://api.elsevier.com/content/article/pii/S0304380006003917", "@rel": "self", "@_fa": "true"}, {"@href": "https://www.sciencedirect.com/science/article/pii/S0304380006003917", "@rel": "scidir", "@_fa": "true"}]}, "scopus-id": "33845403688", "scopus-eid": "2-s2.0-33845403688", "link": {"@href": "https://api.elsevier.com/content/abstract/scopus_id/33845403688", "@rel": "abstract"}, "originalText": {"xocs:doc": {"xocs:meta": {"xocs:open-access": {"xocs:oa-article-status": {"@is-open-access": "0", "@is-open-archive": "0"}}, "xocs:available-online-date": {"@yyyymmdd": "20061006", "$": "2006-10-06"}}}}}