{"scopus-eid": "2-s2.0-84872410298", "originalText": "serial JL 271728 291210 291772 291817 31 Transportation Research Part B: Methodological TRANSPORTATIONRESEARCHPARTBMETHODOLOGICAL 2013-01-11 2013-01-11 2013-01-11T15:41:30 1-s2.0-S0191261512001567 S0191-2615(12)00156-7 S0191261512001567 10.1016/j.trb.2012.12.003 S300 S300.1 FULL-TEXT 1-s2.0-S0191261512X00109 2015-05-14T05:39:52.915433-04:00 0 0 20130101 20130131 2013 2013-01-11T00:00:00Z articleinfo crossmark dco dateupdated tomb dateloaded datesearch indexeddate volumelist yearnav articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright dateloadedtxt docsubtype doctype doi eid ewtransactionid hubeid issn issnnorm itemstage itemtransactionid itemweight openaccess openarchive pg pgfirst pii piinorm pubdateend pubdatestart pubdatetxt pubyr sortorder srctitle srctitlenorm srctype suppl volfirst volissue webpdf webpdfpagecount body articletitle auth authfirstini authfull authlast pubtype alllist content subj ssids 0191-2615 01912615 false 47 47 C Volume 47 2 149 149 201301 January 2013 2013-01-01 2013-01-31 2013 simple-article edi Copyright © 2013 Published by Elsevier Ltd. MESSAGENEWEDITORINCHIEF YANG H YANGX2013X149 YANGX2013X149XH item S0191-2615(12)00156-7 S0191261512001567 1-s2.0-S0191261512001567 10.1016/j.trb.2012.12.003 271728 2013-01-11T13:10:10.375778-05:00 2013-01-01 2013-01-31 1-s2.0-S0191261512001567-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0191261512001567/MAIN/application/pdf/d9b241b769b04a4fa250e5d8349e7db3/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0191261512001567/MAIN/application/pdf/d9b241b769b04a4fa250e5d8349e7db3/main.pdf main.pdf pdf true 87956 MAIN 1 1-s2.0-S0191261512001567-main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S0191261512001567/PREVIEW/image/png/6173acced6aba86b87daa70be0249d36/main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0191261512001567/PREVIEW/image/png/6173acced6aba86b87daa70be0249d36/main_1.png main_1.png png 84353 849 656 IMAGE-WEB-PDF 1 TRB 1052 S0191-2615(12)00156-7 10.1016/j.trb.2012.12.003 Editorial Message from the new Editor-in-Chief Hai Yang Editor-in-Chief It is my great honor and privilege to be appointed as the new Editor-in-Chief (EiC) of Transportation Research Part B (TR-Part B), a world-class journal with a long and prestigious history of publishing high quality archival papers in the transportation field. I consider this appointment will provide an exciting opportunity for me to help guide the journal in its future direction and to serve my colleagues in their research and authorship endeavors. TR-Part B has been left in great shape due to the enthusiastic leadership and superb vision of the outgoing EiC, Professor Fred Mannering, and the joint efforts and dedication of a wonderful team of Associate Editors (AEs) and Editorial Advisory Board (EAB) Members. During his nine years as EiC, Fred has personally been involved in most of the worldwide submissions to the journal, as well as overseeing and navigating the journal’s voyage into the future in an exemplary manner. Our scientific community owes him a considerable debt of gratitude for his foresight and excellent management. I would like to take this opportunity to express my deep personal thanks to Fred, with whom I have worked closely, and from whom I have learned a great deal, over the past nine years. Following Fred is a challenging task; it is my hope and intent to maintain and possibly improve the high standards of excellence already achieved under Fred’s inspiring leadership. Without changing the course of the journal in any fundamental way, I shall continue TR-Part B’s broad vision of publishing important articles on all methodological aspects of transportation research, and I will work closely with the editorial team to manage the journal in much the same way as Fred. Editorial Team. The current AEs are internationally renowned researchers who have made active and significant contributions in shaping the journal into a major outlet for international research dissemination. The EAB members, with whom I have had the opportunity to work and interact, have been instrumental in eliciting and encouraging paper submissions as well as acting as ambassadors for promoting the journal throughout the professional community. I do not see any pressing need to make any big changes to what is already an outstandingly effective team. Nonetheless, as members leave the EAB, I will add some up-and-coming researchers who are active in submitting high quality papers and are able to dedicate their time and effort in speedy and quality paper reviews. Paper Reviews. To improve the quality of the published papers and to ensure their relevance, I will continue with the current pre-screening phase. Through pre-screening, papers that are not within the scope of the journal or are poorly written will be rejected without further review, thereby helping to maintain the efficiency of the editorial process. By working efficiently with the AEs in dealing with their editorial duties, and diligently following-up with the reviewers, I shall make every possible effort to process and publish papers as promptly as possible. Survey Papers and Special Issues. It is essential to maintain the outstanding status of the journal and retain its appeal to our community. To achieve this, I will consider encouraging and even favoring submissions on methodology development associated with certain strategically important topics, through special issues (SIs), as well as invited survey/review papers. These approaches are believed to be important and valuable in maintaining the scope of the journal, attracting readers and authors, and in generating fresh ideas and new perspectives. I have already commenced soliciting a set of commissioned review articles in key areas of interest to the TR-Part B readership. On special issues, I welcome proposals on themes central to the journal that deserve a special spotlight. To ensure that the TR-Part B’s high standards are also maintained for SIs, I intend to appoint a responsible EAB member or an AE to be a co-editor, having direct involvement in the SI review process. Finally, by working together with the research community, I hope we can achieve our goal of making TR-Part B an even more successful, pre-eminent journal, in which articles in all the most interesting and exciting areas of modern transportation research can provide a high level of enlightenment. I look forward to a bright future for TR-Part B.", "scopus-id": "84872410298", "coredata": {"eid": "1-s2.0-S0191261512001567", "dc:description": null, "openArchiveArticle": "false", "prism:coverDate": "2013-01-31", "openaccessUserLicense": null, "prism:aggregationType": "Journal", "prism:url": "https://api.elsevier.com/content/article/pii/S0191261512001567", "dc:creator": {"@_fa": "true", "$": "Yang, Hai"}, "link": [{"@_fa": "true", "@rel": "self", "@href": "https://api.elsevier.com/content/article/pii/S0191261512001567"}, {"@_fa": "true", "@rel": "scidir", "@href": "https://www.sciencedirect.com/science/article/pii/S0191261512001567"}], "dc:format": "application/json", "openaccessType": null, "pii": "S0191-2615(12)00156-7", "prism:volume": "47", "prism:publisher": "Published by Elsevier Ltd.", "dc:title": "Message from the new Editor-in-Chief", "prism:copyright": "Copyright © 2013 Published by Elsevier Ltd.", "openaccess": "0", "prism:issn": "01912615", "openaccessArticle": "false", "prism:publicationName": "Transportation Research Part B: Methodological", "openaccessSponsorType": null, "prism:pageRange": "149", "pubType": "Editorial", "prism:coverDisplayDate": "January 2013", "prism:doi": "10.1016/j.trb.2012.12.003", "prism:startingPage": "149", "dc:identifier": "doi:10.1016/j.trb.2012.12.003", "openaccessSponsorName": null}, "link": {"@rel": "abstract", "@href": "https://api.elsevier.com/content/abstract/scopus_id/84872410298"}}